var symbol = "image://img/1.png"
//var symbol = 'path://M529.294679 1023.700092c-5.498308 0.199938-10.896647 0.299908-16.394956 0.299908-5.498308 0-10.996617-0.099969-16.494925-0.299908h32.889881zM920.27438 690.302674l-218.63273 70.378345c-3.398954 1.099662-3.798831 5.698247-0.599815 7.397724l79.275608 40.687481c10.196863 5.198401 11.696401 19.194094 2.899108 26.591818-59.181791 49.484774-138.157491 81.574901-223.331285 90.372194V527.852657h199.938482c4.398647 0 7.997539-3.598893 7.997539-7.997539v-79.975393c0-4.398647-3.598893-7.997539-7.997539-7.997539H559.985236v-1.699477c0-57.082437 22.892956-111.865581 64.080283-151.353431 31.390342-30.090742 50.684405-72.777607 49.884651-119.86312C672.350662 69.393719 599.273147-1.184566 509.700707 0.015065 421.327898 1.214696 350.04983 73.292519 350.04983 161.965236c0 45.486005 18.694248 86.573363 48.884959 115.964319 41.187327 40.187635 65.079976 94.77084 65.079975 152.253154v1.699477H264.076283c-4.398647 0-7.997539 3.598893-7.99754 7.997539v79.975393c0 4.398647 3.598893 7.997539 7.99754 7.997539h199.938481v397.477702c-84.573978-8.997232-163.649647-41.187327-223.031376-90.472163-8.797293-7.297755-7.297755-21.293448 2.899108-26.591818l79.275608-40.887419c3.199016-1.599508 2.799139-6.298062-0.599816-7.397724l-218.732699-69.8785c-4.198708-1.2996-8.697324 0.999692-10.096893 5.198401l-69.978469 218.832668c-1.099662 3.398954 2.499231 6.398031 5.598278 4.798524l93.971086-48.485082c6.298062-3.298985 13.995694-1.999385 18.894187 3.199016 42.486927 44.886189 96.770225 81.974778 158.451247 107.96678 51.184251 21.593356 106.66718 35.189173 163.24977 40.087665 10.796678 0.999692 21.593356 1.599508 32.390034 1.899416h32.88988c10.296832-0.299908 20.593664-0.899723 30.790527-1.799446 126.361121-10.796678 243.425102-64.680099 322.100894-148.154415 4.898493-5.198401 12.596124-6.498001 18.894186-3.199016l94.071056 48.285143c3.199016 1.599508 6.697939-1.399569 5.598278-4.798523l-70.378346-218.63273c-1.2996-4.098739-5.798216-6.398031-9.996924-4.998462zM446.020301 161.965236c0-36.388804 29.590895-65.979699 65.979699-65.979699s65.979699 29.590895 65.979699 65.979699-29.590895 65.979699-65.979699 65.979699-65.979699-29.590895-65.979699-65.979699z'
//日本
var japan = {
    '河内': "河内<br>河内级1号舰<br>2x双联装305mm/50倍径主炮<br>4x双联装305mm45倍径主炮<br>排水量2.1万吨 航速21节<br><img style='width:200px' src='img/日本/河内.jpg'>",
    '摄津': "摄津<br>河内级2号舰<br>2x双联装305mm/50倍径主炮<br>4x双联装305mm45倍径主炮<br>排水量2.1万吨 航速21节<br><img style='width:200px' src='img/日本/摄津.jpg'>",
    '金刚': "金刚<br>金刚级1号舰<br>4x双联装356mm/45倍径主炮<br>排水量2.6万吨 航速27.5节<br><img style='width:200px' src='img/日本/金刚.jpg'>",
    '雾岛,榛名': "雾岛<br>金刚级4号舰<br>4x双联装356mm/45倍径主炮<br>排水量2.6万吨 航速27.5节<br><img style='width:200px' src='img/日本/雾岛.jpg'><br>榛名<br>金刚级3号舰<br>4x双联装356mm/45倍径主炮<br>排水量2.6万吨 航速27.5节<br><img style='width:200px' src='img/日本/榛名.jpg'>>",
    '比叡': "比叡<br>金刚级2号舰<br>4x双联装356mm/45倍径主炮<br>排水量2.6万吨 航速27.5节<br><img style='width:200px' src='img/日本/比叡.jpg'>",
    '扶桑': "扶桑<br>扶桑级1号舰<br>6x双联装356mm/45倍径主炮<br>排水量2.9万吨 航速22.5节<br><img style='width:200px' src='img/日本/扶桑.jpg'>",
    '山城': "山城<br>扶桑级2号舰<br>6x双联装356mm/45倍径主炮<br>排水量2.9万吨 航速22.5节<br><img style='width:200px' src='img/日本/山城.jpg'>",
    '伊势': "伊势<br>伊势级1号舰<br>6x双联装356mm/45倍径主炮<br>排水量3.5万吨 航速25节<br><img style='width:200px' src='img/日本/伊势.jpg'>",
    '日向': "日向<br>伊势级2号舰<br>6x双联装356mm/45倍径主炮<br>排水量3.5万吨 航速25节<br><img style='width:200px' src='img/日本/日向.jpg'>",
    '长门': "长门<br>长门级1号舰<br>4x双联装410mm/45倍径主炮<br>排水量3.9万吨 航速25.3节<br><img style='width:200px' src='img/日本/长门.jpg'>",
    '陆奥': "陆奥<br>长门级2号舰<br>4x双联装410mm/45倍径主炮<br>排水量3.9万吨 航速25.3节<br><img style='width:200px' src='img/日本/陆奥.jpg'>",
    '大和': "大和<br>大和级2号舰<br>4x双联装410mm/45倍径主炮<br>排水量3.9万吨 航速25.3节<br><img style='width:200px' src='img/日本/大和.jpg'>",
    '武藏': "武藏<br>大和级2号舰<br>4x双联装410mm/45倍径主炮<br>排水量3.9万吨 航速25.3节<br><img style='width:200px' src='img/日本/武藏.jpg'>",
}
var japan_data = [['日本', '1912-03-31', '河内'], ['日本', '1912-07-01', '摄津'],['日本','1913-08-16','金刚'],['日本','1914-08-04','比叡'],['日本','1915-04-19','雾岛,榛名']
,['日本','1915-11-08','扶桑'],['日本','1917-03-11','山城'],['日本','1917-12-01','伊势']
,['日本','1918-04-30','日向'],['日本','1920-11-25','长门'],['日本','1921-10-24','陆奥'],['日本','1941-12-16','大和'],['日本','1942-08-05','武藏']]

//美国
var usa = {
    '南卡罗莱纳': "南卡罗莱纳（BB-26）<br>南卡罗莱纳级1号舰<br>4x双联装305mm/45倍径主炮<br>排水量1.6万吨 航速18节",
    '密歇根': "密歇根（BB-27）<br>南卡罗莱纳级2号舰<br>4x双联装305mm/45倍径主炮<br>排水量1.6万吨 航速18节",
    '特拉华': "特拉华（BB-28）<br>特拉华级1号舰<br>5x双联装305mm/45倍径主炮<br>排水量2万吨 航速21节",
    '北达科他': "特拉华（BB-29）<br>特拉华级2号舰<br>5x双联装305mm/45倍径主炮<br>排水量2万吨 航速21节",
    '佛罗里达': "佛罗里达（BB-30）<br>佛罗里达级1号舰<br>5x双联装305mm/45倍径主炮<br>排水量2.1万吨 航速21节",
    '犹他': "犹他（BB-31）<br>佛罗里达级2号舰<br>5x双联装305mm/45倍径主炮<br>排水量2.1万吨 航速21节",
    '怀俄明': "怀俄明（BB-32）<br>怀俄明级1号舰<br>6x双联装305mm/50倍径主炮<br>排水量2.6万吨 航速21节",
    '阿肯色': "阿肯色（BB-33）<br>怀俄明级2号舰<br>6x双联装305mm/50倍径主炮<br>排水量2.6万吨 航速21节",
    '纽约': "纽约（BB-34）<br>纽约级1号舰<br>5x双联装365mm/45倍径主炮<br>排水量2.7万吨 航速21节",
    '德克萨斯': "德克萨斯（BB-35）<br>纽约级2号舰<br>5x双联装365mm/45倍径主炮<br>排水量2.7万吨 航速21节",
    '内华达': "内华达（BB-36）<br>内华达级1号舰<br>2x双联装365mm/45倍径主炮<br>2x三联装365mm/45倍径主炮<br>排水量2.7万吨 航速20.5节",
    '俄克拉荷马': "俄克拉荷马（BB-37）<br>内华达级2号舰<br>2x双联装365mm/45倍径主炮<br>2x三联装365mm/45倍径主炮<br>排水量2.7万吨 航速20.5节",
    '宾夕法尼亚': "宾夕法尼亚（BB-38）<br>宾夕法尼亚级1号舰<br>4x三联装365mm/45倍径主炮<br>排水量3.1万吨 航速21节",
    '亚利桑那': "亚利桑那（BB-39）<br>宾夕法尼亚级2号舰<br>4x三联装365mm/45倍径主炮<br>排水量3.1万吨 航速21节",
    '新墨西哥': "新墨西哥（BB-40）<br>新墨西哥级1号舰<br>4x三联装365mm/50倍径主炮<br>排水量3.2万吨 航速21节",
    '密西西比': "密西西比（BB-41）<br>新墨西哥级2号舰<br>4x三联装365mm/50倍径主炮<br>排水量3.2万吨 航速21节",
    '爱达荷': "爱达荷（BB-42）<br>新墨西哥级3号舰<br>4x三联装365mm/50倍径主炮<br>排水量3.2万吨 航速21节",
    '田纳西': "田纳西（BB-43）<br>田纳西级1号舰<br>4x三联装365mm/50倍径主炮<br>排水量3.2万吨 航速21节",
    '加利福尼亚': "加利福尼亚（BB-44）<br>田纳西级1号舰<br>4x三联装365mm/50倍径主炮<br>排水量3.2万吨 航速21节",
    '科罗拉多': "科罗拉多（BB-45）<br>科罗拉多级1号舰<br>4x双联装406mm/45倍径主炮<br>排水量3.2万吨 航速21节",
    '马里兰': "马里兰（BB-46）<br>科罗拉多级2号舰<br>4x双联装406mm/45倍径主炮<br>排水量3.2万吨 航速21节",
    '西弗吉尼亚': "西弗吉尼亚（BB-48）<br>科罗拉多级3号舰<br>4x双联装406mm/45倍径主炮<br>排水量3.2万吨 航速21节",
    '北卡罗来纳': "北卡罗来纳（BB-55）<br>北卡罗来纳级1号舰<br>3x三联装406mm/45倍径主炮<br>排水量3.5万吨 航速27节",
    '华盛顿': "华盛顿（BB-56）<br>北卡罗来纳级2号舰<br>3x三联装406mm/45倍径主炮<br>排水量3.5万吨 航速27节",
    '南达科他': "南达科他（BB-57）<br>南达科他级1号舰<br>3x三联装406mm/45倍径主炮<br>排水量3.5万吨 航速27.5节",
    '印第安纳': "印第安纳（BB-58）<br>南达科他级2号舰<br>3x三联装406mm/45倍径主炮<br>排水量3.5万吨 航速27.5节",
    '马萨诸塞': "马萨诸塞（BB-59）<br>南达科他级3号舰<br>3x三联装406mm/45倍径主炮<br>排水量3.5万吨 航速27.5节",
    '亚拉巴马': "亚拉巴马（BB-60）<br>南达科他级4号舰<br>3x三联装406mm/45倍径主炮<br>排水量3.5万吨 航速27.5节",
    '衣阿华': "衣阿华（BB-61）<br>衣阿华级1号舰<br>3x三联装406mm/50倍径主炮<br>排水量4.5万吨 航速33节",
    '新泽西': "新泽西（BB-62）<br>衣阿华级2号舰<br>3x三联装406mm/50倍径主炮<br>排水量4.5万吨 航速33节",
    '密苏里': "密苏里（BB-63）<br>衣阿华级3号舰<br>3x三联装406mm/50倍径主炮<br>排水量4.5万吨 航速33节",
    '威斯康星': "威斯康星（BB-64）<br>衣阿华级4号舰<br>3x三联装406mm/50倍径主炮<br>排水量4.5万吨 航速33节",
}
var usa_data = [['美国','1910-03-01','南卡罗莱纳'],['美国','1910-01-04','密歇根'],['美国','1910-04-04','特拉华'],['美国','1910-04-11','北达科他']
,['美国','1911-08-31','犹他'],['美国','1911-09-15','佛罗里达'],['美国','1912-09-17','阿肯色'],['美国','1912-09-25','怀俄明']
,['美国','1914-03-12','德克萨斯'],['美国','1914-04-15','纽约'],['美国','1916-03-11','内华达'],['美国','1916-05-02','俄克拉荷马']
,['美国','1916-06-12','宾夕法尼亚'],['美国','1916-10-17','亚利桑那'],['美国','1917-12-18','密西西比'],['美国','1918-05-20','新墨西哥']
,['美国','1919-03-24','爱达荷'],['美国','1920-06-03','田纳西'],['美国','1921-07-21','马里兰'],['美国','1921-08-10','加利福尼亚'],['美国','1923-08-30','科罗拉多']
,['美国','1923-12-01','西弗吉尼亚']
,['美国','1941-04-09','北卡罗来纳'],['美国','1941-05-15','华盛顿'],['美国','1942-03-20','南达科他'],['美国','1942-04-30','印第安纳']
,['美国','1942-05-12','马萨诸塞']
,['美国','1942-08-16','亚拉巴马'],['美国','1943-02-22','衣阿华'],['美国','1943-05-23','新泽西']
,['美国','1944-04-16','威斯康星'],['美国','1944-06-11','密苏里']]

//法国
var france = {
    "孤拔,让·巴尔(1913)": "孤拔<br>孤拔级1号舰<br>让·巴尔<br>孤拔级2号舰<br>6x双联装305mm/45倍径主炮<br>排水量2.3万吨 航速21节>",
    "巴黎": "巴黎<br>孤拔级3号舰<br>6x双联装305mm/45倍径主炮<br>排水量2.3万吨 航速21节",
    "法兰西": "法兰西<br>孤拔级4号舰<br>6x双联装305mm/45倍径主炮<br>排水量2.3万吨 航速21节",
    "布列塔尼":"布列塔尼<br>布列塔尼级1号舰<br>5x双联装340mm/45倍径主炮<br>排水量2.3万吨 航速20节",
    "普罗旺斯":"普罗旺斯<br>布列塔尼级2号舰<br>5x双联装340mm/45倍径主炮<br>排水量2.3万吨 航速20节",
    "洛林":"洛林<br>布列塔尼级3号舰<br>5x双联装340mm/45倍径主炮<br>排水量2.3万吨 航速20节",
    "敦刻尔克":"敦刻尔克<br>敦刻尔克级1号舰<br>2x四联装330mm/50倍径主炮<br>排水量2.6万吨 航速31节",
    "斯特拉斯堡":"斯特拉斯堡<br>敦刻尔克级2号舰<br>2x四联装330mm/50倍径主炮<br>排水量2.6万吨 航速31节",
    "黎塞留":"黎塞留<br>黎塞留级1号舰<br>2x四联装380mm/45倍径主炮<br>排水量3.6万吨 航速32节",
    "让·巴尔(1955)":"让·巴尔<br>黎塞留级2号舰<br>2x四联装380mm/45倍径主炮<br>排水量3.6万吨 航速32节",
}
var france_data = [['法国','1913-11-19','孤拔,让·巴尔(1913)'],['法国','1914-08-01','巴黎'],
['法国','1914-10-10','法兰西'],['法国','1916-02-10','布列塔尼'],['法国','1916-03-01','普罗旺斯'],
['法国','1916-03-10','洛林'],['法国','1937-05-01','敦刻尔克'],['法国','1938-09-10','斯特拉斯堡'],
['法国','1943-10-10','黎塞留'],['法国','1955-05-01','让·巴尔(1955)']]

//意大利
var italy = {
    "但丁·阿利吉耶里":"但丁·阿利吉耶里<br>没有同级舰<br>4x三联装305mm/46倍径主炮<br>排水量1.9万吨 航速22节",
    "加富尔伯爵":"加富尔伯爵<br>加富尔伯爵级1号舰<br>2x双联装305mm/46倍径主炮<br>3x三联装305mm/46倍径主炮<br>排水量2.3万吨 航速21.5节",
    "朱利奥·凯撒":"朱利奥·凯撒<br>加富尔伯爵级2号舰<br>2x双联装305mm/46倍径主炮<br>3x三联装305mm/46倍径主炮<br>排水量2.3万吨 航速21.5节",
    "莱昂纳多·达·芬奇":"莱昂纳多·达·芬奇<br>加富尔伯爵级3号舰<br>2x双联装320mm/46倍径主炮<br>3x三联装305mm/46倍径主炮<br>排水量2.3万吨 航速21.5节",
    "安德烈亚·多里亚":"安德烈亚·多里亚<br>安德烈亚·多里亚级1号舰<br>2x三联装320mm/46倍径主炮<br>2x双联装320mm/46倍径主炮<br>排水量2.3万吨 航速23节",
    "卡约·杜伊利奥":"卡约·杜伊利奥<br>安德烈亚·多里亚级2号舰<br>2x三联装320mm/46倍径主炮<br>2x双联装320mm/46倍径主炮<br>排水量2.3万吨 航速23节",
    "维托里奥·维内托":"维托里奥·维内托<br>维托里奥·维内托级1号舰<br>3x三联装381mm/50倍径主炮<br>排水量4.1万吨 航速30节",
    "利托里奥":"利托里奥<br>维托里奥·维内托级2号舰<br>3x三联装381mm/50倍径主炮<br>排水量4.1万吨 航速30节",
    "罗马":"罗马<br>维托里奥·维内托级3号舰<br>3x三联装381mm/50倍径主炮<br>排水量4.1万吨 航速30节",
}
var italy_data = [
    ['意大利','1913-01-15','但丁·阿利吉耶里'],['意大利','1913-05-17','莱昂纳多·达·芬奇'],
    ['意大利','1914-05-14','朱利奥·凯撒'],['意大利','1915-04-01','加富尔伯爵'],
    ['意大利','1915-05-10','卡约·杜伊利奥'],['意大利','1916-03-13','安德烈亚·多里亚'],
    ['意大利','1940-05-06','利托里奥'],['意大利','1940-05-15','维托里奥·维内托'],
    ['意大利','1942-06-14','罗马']
]

//英国
var england = {
    //无畏
    "无畏":"无畏<br>没有同级舰<br>5x双联装305mm/45倍径主炮<br>排水量1.84万吨 航速21节",
    //柏勒罗丰
    "柏勒罗丰":"柏勒罗丰<br>柏勒罗丰级1号舰<br>5x双联装305mm/45倍径主炮<br>排水量1.88万吨 航速20.75节",
    "壮丽":"壮丽<br>柏勒罗丰级2号舰<br>5x双联装305mm/45倍径主炮<br>排水量1.88万吨 航速20.75节",
    "鲁莽":"鲁莽<br>柏勒罗丰级3号舰<br>5x双联装305mm/45倍径主炮<br>排水量1.88万吨 航速20.75节",
    //圣文森特
    "圣文森特":"圣文森特<br>圣文森特级1号舰<br>5x双联装305mm/50倍径主炮<br>排水量1.95万吨 航速21.5节",
    "科林伍德":"科林伍德<br>圣文森特级2号舰<br>5x双联装305mm/50倍径主炮<br>排水量1.95万吨 航速21.5节",
    "前卫(1909)":"前卫<br>圣文森特级3号舰<br>5x双联装305mm/50倍径主炮<br>排水量1.95万吨 航速21.5节",
    //海王星
    "海王星":"海王星<br>没有同级舰<br>5x双联装305mm/50倍径主炮<br>排水量1.96万吨 航速21节",
    //巨人
    "巨人":"巨人<br>巨人级1号舰<br>5x双联装305mm/50倍径主炮<br>排水量2.02万吨 航速21节",
    "大力神":"大力神<br>巨人级2号舰<br>5x双联装305mm/50倍径主炮<br>排水量2.02万吨 航速21节",
    //猎户座
    "猎户座":"猎户座<br>猎户座级1号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    "君主":"君主<br>猎户座级2号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    "征服者":"征服者<br>猎户座级3号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    "雷神":"雷神<br>猎户座级4号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    //乔治五世
    "乔治五世":"乔治五世<br>乔治五世级1号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    "百夫长":"百夫长<br>乔治五世级2号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    "大胆":"大胆<br>乔治五世级3号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    "阿贾克斯":"阿贾克斯<br>乔治五世级4号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.22万吨 航速21节",
    //铁公爵
    "铁公爵":"铁公爵<br>铁公爵级1号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.58万吨 航速21.6节",
    "马尔伯罗":"马尔伯罗<br>铁公爵级2号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.58万吨 航速21.6节",
    "本鲍":"本鲍<br>铁公爵级3号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.58万吨 航速21.6节",
    "印度皇帝":"印度皇帝<br>铁公爵级4号舰<br>5x双联装343mm/45倍径主炮<br>排水量2.58万吨 航速21.6节",
    //伊丽莎白女王
    "伊丽莎白":"伊丽莎白<br>伊丽莎白女王级1号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.91万吨 航速25节",
    "厌战":"厌战<br>伊丽莎白女王级2号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.91万吨 航速25节",
    "巴勒姆":"巴勒姆<br>伊丽莎白女王级3号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.91万吨 航速25节",
    "勇士":"勇士<br>伊丽莎白女王级4号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.91万吨 航速25节",
    "马来亚,复仇":"马来亚<br>伊丽莎白女王级5号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.91万吨 航速25节<br>复仇<br>复仇级1号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.81万吨 航速21.5节",
    //复仇
    "决心":"决心<br>复仇级2号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.81万吨 航速21.5节",
    "拉米利斯":"拉米利斯<br>复仇级3号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.81万吨 航速21.5节",
    "君权":"君权<br>复仇级4号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.81万吨 航速21.5节",
    "皇家橡树":"皇家橡树<br>复仇级5号舰<br>4x双联装381mm/42倍径主炮<br>排水量2.81万吨 航速21.5节",
    //纳尔逊
    "纳尔逊":"纳尔逊<br>纳尔逊级1号舰<br>4x双联装406mm/45倍径主炮<br>排水量3.6万吨 航速23节",
    "罗德尼":"罗德尼<br>纳尔逊级2号舰<br>4x双联装406mm/45倍径主炮<br>排水量3.6万吨 航速23节",
    //乔治五世级
    "乔治五世":"乔治五世<br>乔治五世级1号舰<br>2x四联装356mm/45倍径主炮<br>1x双联装356mm/45倍径主炮<br>排水量3.73万吨 航速28节",
    "威尔士亲王":"威尔士亲王<br>乔治五世级2号舰<br>2x四联装356mm/45倍径主炮<br>1x双联装356mm/45倍径主炮<br>排水量3.73万吨 航速28节",
    "约克公爵":"约克公爵<br>乔治五世级3号舰<br>2x四联装356mm/45倍径主炮<br>1x双联装356mm/45倍径主炮<br>排水量3.73万吨 航速28节",
    "安森":"安森<br>乔治五世级4号舰<br>2x四联装356mm/45倍径主炮<br>1x双联装356mm/45倍径主炮<br>排水量3.73万吨 航速28节",
    "豪":"豪<br>乔治五世级5号舰<br>2x四联装356mm/45倍径主炮<br>1x双联装356mm/45倍径主炮<br>排水量3.73万吨 航速28节",
    //前卫
    "前卫":"前卫<br>没有同级舰<br>4x双联装381mm/42倍径主炮<br>排水量4.52万吨 航速30节",

}

var england_data = [
    //无畏
    ['英国','1906-12-02','无畏'],
    //圣文森特
    ['英国','1908-09-10','圣文森特'],['英国','1908-11-07','科林伍德'],
    //柏勒罗丰和圣文森特
    ['英国','1909-02-20','柏勒罗丰'],['英国','1909-02-22','前卫(1909)'],['英国','1909-05-15','鲁莽'],['英国','1909-06-09','壮丽'],
    //海王星
    ['英国','1911-01-11','海王星'],
    //巨人
    ['英国','1911-07-31','大力神'],['英国','1911-08-08','巨人'],
    //猎户座
    ['英国','1912-01-02','猎户座'], ['英国','1912-04-27','君主'], ['英国','1912-06-15','雷神'],['英国','1912-11-16','乔治五世'],['英国','1912-12-01','征服者'], 
    //乔治五世
    ['英国','1913-05-22','百夫长'], ['英国','1913-10-15','大胆'], ['英国','1913-10-31','阿贾克斯'],
    //铁公爵
    ['英国','1914-03-10','铁公爵'],['英国','1914-06-02','马尔伯罗'],['英国','1914-10-07','本鲍'],['英国','1914-11-10','印度皇帝'],
    //伊丽莎白女王
    ['英国','1914-12-22','伊丽莎白'],['英国','1915-03-08','厌战'],['英国','1915-10-19','巴勒姆'],['英国','1916-01-13','勇士'],['英国','1916-02-01','马来亚,复仇'],
    //复仇
    ['英国','1916-04-18','君权'],['英国','1916-05-01','皇家橡树'],['英国','1916-12-30','决心'],['英国','1917-09-01','拉米利斯'],
    //纳尔逊
    ['英国','1925-09-03','纳尔逊'], ['英国','1925-11-07','罗德尼'],
    //乔治五世
    ['英国','1940-10-01','乔治五世'],['英国','1941-01-19','威尔士亲王'],['英国','1941-08-19','约克公爵'],['英国','1942-04-14','安森'],['英国','1942-06-17','豪'],
    ['英国','1946-05-12','前卫']


]